WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
/**
 * vendor_commands.c — DSPi STM32H723 vendor USB control request dispatch
 *
 * M7a: GET_PLATFORM stub.
 * M7b: + GET_ALL_PARAMS / SET_ALL_PARAMS bulk transfers, GET_STATUS.
 *      DSPi Console reads the entire DSP state in one shot via
 *      REQ_GET_ALL_PARAMS and populates its UI from that. SET_ALL_PARAMS
 *      writes back; the DSP-pipeline globals get the new values, but
 *      audio processing isn't wired up yet (M7c).
 *
 * Subsequent milestones (M7c–M7d) port the rest of the ~30 vendor
 * commands from firmware/DSPi/vendor_commands.c.
 */

#include <string.h>
#include <math.h>

#include "stm32h7xx_hal.h"   /* HAL_RCC_GetSysClockFreq for REQ_GET_STATUS w=13 */
#include "tusb.h"
#include "config.h"
#include "vendor_commands.h"
#include "bulk_params.h"
#include "dsp_pipeline.h"

#include "usb_audio.h"   /* update_master_volume, AudioState, channel_names */
#include "audio_input.h" /* INPUT_SOURCE_USB / SPDIF + change-pending flag */
#include "spdif_input.h" /* M9: SpdifRxStatusPacket + status accessor */
#include "notify.h"      /* notify_param_write — M7j */
#include "flash_storage.h"  /* preset_save / load / delete / etc. — M11 */
#include "w25q.h"           /* debug GETs probe W25Q directly */
#include <stddef.h>      /* offsetof */

extern uint8_t channel_band_counts[NUM_CHANNELS];
extern MatrixMixer matrix_mixer;
extern volatile float    global_preamp_db    [NUM_INPUT_CHANNELS];
extern volatile float    global_preamp_linear[NUM_INPUT_CHANNELS];
extern volatile int32_t  global_preamp_mul   [NUM_INPUT_CHANNELS];
extern volatile float    master_volume_db;
extern volatile SystemStatusPacket global_status;

extern volatile bool   bypass_master_eq;
extern volatile bool   loudness_enabled;
extern volatile float  loudness_ref_spl;
extern volatile float  loudness_intensity_pct;
extern volatile bool   loudness_recompute_pending;
#include "crossfeed.h"
extern volatile CrossfeedConfig crossfeed_config;
extern volatile bool            crossfeed_update_pending;
#include "leveller.h"
extern volatile LevellerConfig leveller_config;
extern volatile bool           leveller_update_pending;
extern volatile bool           leveller_reset_pending;
extern volatile float channel_gain_db    [3];
extern volatile float channel_gain_linear[3];
extern volatile int32_t channel_gain_mul [3];
extern volatile bool  channel_mute       [3];
extern float channel_delays_ms[NUM_CHANNELS];
extern int32_t channel_delay_samples[NUM_DELAY_CHANNELS];
extern bool    any_delay_active;
extern uint8_t output_types[NUM_SPDIF_INSTANCES];
extern uint8_t output_pins[NUM_PIN_OUTPUTS];
extern uint8_t  i2s_bck_pin;
extern uint8_t  i2s_mck_pin;
extern bool     i2s_mck_enabled;
extern uint16_t i2s_mck_multiplier;

static inline float db_to_linear(float db) {
    return powf(10.0f, db * 0.05f);
}

/* M7d helper: keep all three preamp views (db / linear / Q28 mul) in
 * sync. The DSP fill_half currently uses `_linear`; the others are
 * preserved so the bulk_params snapshot matches the RP build's wire
 * format. */
static void update_preamp_ch(uint8_t ch, float db) {
    if (ch >= NUM_INPUT_CHANNELS) return;
    if (db < -90.0f) db = -90.0f;
    if (db >  20.0f) db =  20.0f;
    float lin = db_to_linear(db);
    global_preamp_db    [ch] = db;
    global_preamp_linear[ch] = lin;
    global_preamp_mul   [ch] = (int32_t)(lin * (1 << 28));
}

/* Bulk SET payload buffer — sized for one WireBulkParams transfer.
 * tud_control_xfer chunks the actual EP0 transfers; the application
 * just provides one contiguous buffer of wLength bytes. */
/* bulk_param_buf is non-static — main.c drains it from the main loop after
 * REQ_SET_ALL_PARAMS deposits a full state via tud_control_xfer. */
uint8_t __attribute__((aligned(4))) bulk_param_buf[sizeof(WireBulkParams)];

/* Set on the SET-side ACK stage; the main loop checks and calls
 * bulk_params_apply() when true (M7c will hook the main loop into
 * this — for M7b we just record it and let the DSP-pipeline-less
 * code path effectively no-op the application). */
volatile bool bulk_params_pending = false;

/* Captured at SETUP so the DATA-stage handler knows what to do. */
static uint8_t  vendor_last_request = 0;
static uint16_t vendor_last_wValue  = 0;
static uint16_t vendor_last_wLength = 0;
static uint8_t  vendor_rx_buf[64];   /* Generic SET payload buffer (≤ EP0 size) */

bool tud_vendor_control_xfer_cb(uint8_t rhport,
                                uint8_t stage,
                                tusb_control_request_t const *req) {
    /* ---- SETUP stage ---- */
    if (stage == CONTROL_STAGE_SETUP) {
        bool const is_get = (req->bmRequestType & 0x80) != 0;

        if (is_get) {
            switch (req->bRequest) {
                case REQ_GET_PLATFORM: {
                    /* DSPi Console expects 4 bytes:
                     *   [0] platform ID
                     *   [1] FW major (BCD high byte)
                     *   [2] FW minor (high nibble) + patch (low nibble)
                     *   [3] NUM_OUTPUT_CHANNELS (informational)
                     * Returning fewer = short-read STALL = Console dies. */
                    static uint8_t resp[4] = {
                        (uint8_t)DSPI_PLATFORM,
                        (uint8_t)(FW_VERSION_BCD >> 8),
                        (uint8_t)(FW_VERSION_BCD & 0xFF),
                        (uint8_t)NUM_OUTPUT_CHANNELS,
                    };
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            resp, sizeof(resp));
                }
                case REQ_GET_ALL_PARAMS: {
                    bulk_params_collect((WireBulkParams *)bulk_param_buf);
                    uint16_t len = sizeof(WireBulkParams);
                    if (req->wLength < len) len = req->wLength;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            bulk_param_buf, len);
                }
                case REQ_GET_STATUS: {
                    /* Console polls wValue=9 for combined status:
                     *   NUM_CHANNELS×u16 peaks + cpu0 + cpu1 + u16 clip_flags
                     * = 11×2 + 1 + 1 + 2 = 26 bytes on STM32H723 (RP2350-shape).
                     * wValue=15 returns the current sample rate as u32. */
                    static uint8_t status_buf[NUM_CHANNELS * 2 + 4];
                    if (req->wValue == 9) {
                        for (int i = 0; i < NUM_CHANNELS; ++i) {
                            status_buf[i*2]     = global_status.peaks[i] & 0xFF;
                            status_buf[i*2 + 1] = global_status.peaks[i] >> 8;
                        }
                        status_buf[NUM_CHANNELS * 2]     = global_status.cpu0_load;
                        status_buf[NUM_CHANNELS * 2 + 1] = global_status.cpu1_load;
                        status_buf[NUM_CHANNELS * 2 + 2] = global_status.clip_flags & 0xFF;
                        status_buf[NUM_CHANNELS * 2 + 3] = global_status.clip_flags >> 8;
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                status_buf, sizeof(status_buf));
                    }
                    if (req->wValue == 15) {
                        static uint32_t rate;
                        rate = audio_state.freq;
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                &rate, 4);
                    }
                    /* M7g — system stats Console polls per-second:
                     *   13: SYSCLK (Hz) — 550 MHz on STM32H723 at VOS0
                     *   14: Vdda  (mV) — back-computed from VREFINT
                     *   16: Tj    (centi-°C) — internal temp sensor
                     */
                    if (req->wValue == 13) {
                        static uint32_t hz;
                        hz = HAL_RCC_GetSysClockFreq();
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                &hz, 4);
                    }
                    /* wValue=14 (Vdda mV) intentionally falls through to
                     * STALL — Console treats a failed request as "feature
                     * not supported" and hides the field. STM32H7's Vdda is
                     * pin-bonded to 3.3 V on this board, so a back-computed
                     * value adds noise without information. */
                    if (req->wValue == 16) {
                        extern int16_t read_temperature_cdeg(void);
                        static int32_t cdeg;
                        cdeg = (int32_t)read_temperature_cdeg();
                        return tud_control_xfer(rhport,
                                                (tusb_control_request_t *)req,
                                                &cdeg, 4);
                    }
                    return false;
                }
                case REQ_GET_PREAMP: {
                    /* Legacy single-value GET — returns channel 0's preamp. */
                    static float v;
                    v = global_preamp_db[0];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_PREAMP_CH: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= NUM_INPUT_CHANNELS) return false;
                    static float v;
                    v = global_preamp_db[ch];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_MASTER_VOLUME: {
                    static float v;
                    v = master_volume_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_INPUT_SOURCE: {
                    static uint8_t src;
                    src = active_input_source;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &src, 1);
                }
                /* REQ_SET_INPUT_SOURCE — NOT handled here. Despite the
                 * name and our REQ_SET_OUTPUT_TYPE precedent (which IS
                 * a side-effecting vendor IN), this one is a plain
                 * vendor OUT with a 1-byte DATA payload per the RP
                 * convention. See the SET/DATA-stage handler below. */

                case REQ_GET_SPDIF_RX_STATUS: {
                    static SpdifRxStatusPacket pkt;
                    spdif_input_get_status(&pkt);
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &pkt, sizeof(pkt));
                }
                case REQ_GET_SPDIF_RX_CH_STATUS: {
                    static uint8_t cs[24];
                    spdif_input_get_channel_status(cs);
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            cs, sizeof(cs));
                }

                case REQ_GET_BYPASS: {
                    static uint8_t v;
                    v = bypass_master_eq ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_DELAY: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= NUM_CHANNELS) return false;
                    static float v;
                    v = channel_delays_ms[ch];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CHANNEL_GAIN: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= 3) return false;
                    static float v;
                    v = channel_gain_db[ch];
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CHANNEL_MUTE: {
                    uint8_t ch = req->wValue & 0xFF;
                    if (ch >= 3) return false;
                    static uint8_t v;
                    v = channel_mute[ch] ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                case REQ_GET_LOUDNESS: {
                    static uint8_t v; v = loudness_enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LOUDNESS_REF: {
                    static float v; v = loudness_ref_spl;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_LOUDNESS_INTENSITY: {
                    static float v; v = loudness_intensity_pct;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }

                case REQ_GET_CROSSFEED: {
                    static uint8_t v; v = crossfeed_config.enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_CROSSFEED_PRESET: {
                    static uint8_t v; v = crossfeed_config.preset;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_CROSSFEED_FREQ: {
                    static float v; v = crossfeed_config.custom_fc;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CROSSFEED_FEED: {
                    static float v; v = crossfeed_config.custom_feed_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_CROSSFEED_ITD: {
                    static uint8_t v; v = crossfeed_config.itd_enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }

                case REQ_GET_LEVELLER_ENABLE: {
                    static uint8_t v; v = leveller_config.enabled ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LEVELLER_AMOUNT: {
                    static float v; v = leveller_config.amount;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_LEVELLER_SPEED: {
                    static uint8_t v; v = leveller_config.speed;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LEVELLER_MAX_GAIN: {
                    static float v; v = leveller_config.max_gain_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case REQ_GET_LEVELLER_LOOKAHEAD: {
                    static uint8_t v; v = leveller_config.lookahead ? 1 : 0;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 1);
                }
                case REQ_GET_LEVELLER_GATE: {
                    static float v; v = leveller_config.gate_threshold_db;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req, &v, 4);
                }
                case 0xFA: {  /* DEBUG (M12 P3): per-slot SAI CR1.PRTCFG.
                               * Returns 4 bytes: byte N = PRTCFG bits[3:2]
                               * for slot N's SAI sub-block. 0=I2S/free,
                               * 1=SPDIF. Verify reboot-after-SET actually
                               * landed in SPDIF mode without a scope. */
                    static uint8_t buf[4];
                    buf[0] = (uint8_t)((SAI1_Block_A->CR1 >> 2) & 0x3);
                    buf[1] = (uint8_t)((SAI1_Block_B->CR1 >> 2) & 0x3);
                    buf[2] = (uint8_t)((SAI4_Block_A->CR1 >> 2) & 0x3);
                    buf[3] = (uint8_t)((SAI4_Block_B->CR1 >> 2) & 0x3);
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            buf, sizeof(buf));
                }
                case 0xF2: {  /* DEBUG (M9): runtime switch SPDIFRX INSEL
                               * field. wValue lo byte = new INSEL value
                               * (0..3). Restarts the SYNC state machine
                               * on the new input. Returns the new CR
                               * value (4 bytes) so caller can confirm. */
                    uint32_t insel = req->wValue & 0x3;
                    /* Disable peripheral, change INSEL, re-enable SYNC. */
                    SPDIFRX->CR &= ~SPDIFRX_CR_SPDIFEN;
                    while (SPDIFRX->CR & SPDIFRX_CR_SPDIFEN) ;
                    SPDIFRX->CR = (SPDIFRX->CR & ~SPDIFRX_CR_INSEL)
                                | (insel << 16);
                    SPDIFRX->CR |= 1;   /* SPDIFEN[1:0] = 01 (SYNC) */
                    static uint32_t resp;
                    resp = SPDIFRX->CR;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            &resp, 4);
                }
                case 0xF4: {  /* DEBUG (M9): SPDIFRX register snapshot.
                               * 32-byte payload, u32 LE: */
                    static uint32_t buf[8];
                    buf[0] = SPDIFRX->CR;
                    buf[1] = SPDIFRX->SR;
                    buf[2] = SPDIFRX->IMR;
                    buf[3] = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SPDIFRX);
                    buf[4] = GPIOD->AFR[1];       /* PD8 AF nibble bits[3:0] of AFR[1] */
                    buf[5] = GPIOD->MODER;        /* PD8 mode bits[17:16] */
                    buf[6] = GPIOD->PUPDR;        /* PD8 pull bits[17:16] */
                    buf[7] = (uint32_t)HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_8)
                           | ((uint32_t)(GPIOD->IDR & GPIO_PIN_8) << 8);
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            buf, sizeof(buf));
                }
                case 0xF6: {  /* DEBUG (M9): PD8 as plain INPUT + internal
                               * pull-up, AF routing disconnected. Used
                               * during M9 bring-up to isolate whether
                               * the active AF (originally AF8, since
                               * fixed to AF9) was routing PD8 to a
                               * conflicting peripheral that drove the
                               * line low. With AF disconnected the pin
                               * goes high (pull-up wins), proving the
                               * AF mux was the culprit, not the
                               * SPDIFRX block itself.
                               *
                               * Also disables SPDIFEN to take the
                               * SPDIFRX peripheral cleanly out of the
                               * picture for the test. */
                    __HAL_RCC_GPIOD_CLK_ENABLE();
                    /* Force SPDIFRX peripheral OFF — SPDIFEN field to 00 */
                    SPDIFRX->CR &= ~(0x3u << 0);
                    /* MODER bits[17:16] = 00 (INPUT) */
                    GPIOD->MODER &= ~(0x3u << 16);
                    /* OTYPER bit 8: don't care in input mode */
                    /* PUPDR bits[17:16] = 01 (pull-up) */
                    GPIOD->PUPDR  &= ~(0x3u << 16);
                    GPIOD->PUPDR  |=  (0x1u << 16);
                    /* AFRH nibble[3:0] = 0 */
                    GPIOD->AFR[1] &= ~0xFu;

                    static uint32_t buf[5];
                    buf[0] = GPIOD->MODER;
                    buf[1] = GPIOD->PUPDR;
                    buf[2] = GPIOD->AFR[1];
                    buf[3] = GPIOD->IDR;
                    buf[4] = SPDIFRX->CR;
                    return tud_control_xfer(rhport,
                                            (tusb_control_request_t *)req,
                                            buf, sizeof(buf));
                }
                case 0xF5: {  /* DEBUG (M9): drive PD8 as a plain GPIO
                               * push-pull output HIGH, bypassing the AF
                               * routing (clears AFR nibble). Used during
                               * M9 bring-up to prove the pad itself was
                               * healthy when AF routing was suspect.
                               * Returns the resulting MODER, PUPDR, ODR
                               * and live IDR so the host can confirm the
                               * config actually landed. If the pin still
                               * reads 0 V externally with this command
                               * issued, the silicon is damaged. */
                    __HAL_RCC_GPIOD_CLK_ENABLE();
                    /* MODER bits[17:16] for PD8 — clear then set to 01 (output) */
                    GPIOD->MODER &= ~(0x3u << 16);
                    GPIOD->MODER |=  (0x1u << 16);
                    /* OTYPER bit 8 = 0 (push-pull) */
                    GPIOD->OTYPER &= ~(1u << 8);
                    /* OSPEEDR bits[17:16] = 11 (very high) */
                    GPIOD->OSPEEDR |= (0x3u << 16);
                    /* PUPDR bits[17:16] = 00 (no pull — output drives it) */
                    GPIOD->PUPDR  &= ~(0x3u << 16);
                    /* AFRH nibble [3:0] = 0 — irrelevant in OUTPUT mode but
                     * tidy. */
                    GPIOD->AFR[1] &= ~0xFu;
                    /* Drive HIGH via BSRR */
                    GPIOD->BSRR = (1u << 8);

