WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
        if (req->wLength == 0) {
            /* Zero-length SET — slot/index lives in wValue, no payload.
             * Dispatch action here (no DATA stage will fire), then ack. */
            extern volatile uint8_t last_preset_result;
            uint8_t slot = req->wValue & 0xFF;
            switch (req->bRequest) {
                case REQ_PRESET_SAVE:
                    last_preset_result = preset_save(slot);
                    break;
                case REQ_PRESET_LOAD:
                    last_preset_result = preset_load(slot);
                    break;
                case REQ_PRESET_DELETE:
                    last_preset_result = preset_delete(slot);
                    break;
                case REQ_PRESET_SET_STARTUP: {
                    uint8_t mode = (req->wValue >> 8) & 0xFF;
                    uint8_t dflt =  req->wValue       & 0xFF;
                    last_preset_result = preset_set_startup(mode, dflt);
                    break;
                }
                default: break;
            }
            return tud_control_status(rhport, (tusb_control_request_t *)req);
        }

        /* All other small SETs land in vendor_rx_buf for the DATA-stage
         * dispatcher to consume. */
        if (req->wLength <= sizeof(vendor_rx_buf)) {
            return tud_control_xfer(rhport,
                                    (tusb_control_request_t *)req,
                                    vendor_rx_buf, req->wLength);
        }

        return false;
    }

    /* ---- DATA stage (SET payload arrived) ---- */
    if (stage == CONTROL_STAGE_DATA) {
        if ((req->bmRequestType & 0x80) != 0) return true;   /* GET — ignore */

        switch (vendor_last_request) {
            case REQ_SET_EQ_PARAM: {
                if (vendor_last_wLength < sizeof(EqParamPacket)) break;
                EqParamPacket pkt;
                memcpy(&pkt, vendor_rx_buf, sizeof(pkt));
                pkt.bypass = (pkt.bypass == 1) ? 1 : 0;
                if (pkt.channel < NUM_CHANNELS
                    && pkt.band < channel_band_counts[pkt.channel]) {
                    filter_recipes[pkt.channel][pkt.band] = pkt;
                    dsp_compute_coefficients(&filter_recipes[pkt.channel][pkt.band],
                                             &filters[pkt.channel][pkt.band],
                                             48000.0f);
                    /* Push the entire WireBandParams (16 bytes) so Console
                     * sees the type/freq/Q/gain change in one event. */
                    WireBandParams wp = {
                        .type    = pkt.type,
                        .bypass  = pkt.bypass,
                        .freq    = pkt.freq,
                        .q       = pkt.Q,
                        .gain_db = pkt.gain_db,
                    };
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, eq)
                                   + (pkt.channel * WIRE_MAX_BANDS + pkt.band)
                                       * sizeof(WireBandParams)),
                        sizeof(WireBandParams), &wp);
                }
                break;
            }

            case REQ_SET_BAND_BYPASS: {
                /* Console toggles the per-band bypass via this dedicated
                 * opcode (NOT REQ_SET_EQ_PARAM). wValue = (ch<<8)|band,
                 * payload = 1 byte (1 = bypass, else active). Recompute
                 * coefficients so dsp_pipeline picks up the new bypass
                 * flag — without that the filters[][] entry's compiled
                 * state still applies the old (un-bypassed) curve. */
                if (vendor_last_wLength < 1) break;
                uint8_t ch   = (vendor_last_wValue >> 8) & 0xFF;
                uint8_t band =  vendor_last_wValue       & 0xFF;
                if (ch < NUM_CHANNELS && band < channel_band_counts[ch]) {
                    uint8_t v = (vendor_rx_buf[0] == 1) ? 1 : 0;
                    filter_recipes[ch][band].bypass = v;
                    dsp_compute_coefficients(&filter_recipes[ch][band],
                                             &filters[ch][band],
                                             (float)audio_state.freq);
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, eq)
                                   + (ch * WIRE_MAX_BANDS + band) * sizeof(WireBandParams)
                                   + offsetof(WireBandParams, bypass)),
                        1, &v);
                }
                break;
            }

            case REQ_SET_MATRIX_ROUTE: {
                if (vendor_last_wLength < sizeof(MatrixRoutePacket)) break;
                MatrixRoutePacket pkt;
                memcpy(&pkt, vendor_rx_buf, sizeof(pkt));
                if (pkt.input < NUM_INPUT_CHANNELS
                    && pkt.output < NUM_OUTPUT_CHANNELS) {
                    MatrixCrosspoint *xp = &matrix_mixer.crosspoints[pkt.input][pkt.output];
                    xp->enabled      = pkt.enabled;
                    xp->phase_invert = pkt.phase_invert;
                    xp->gain_db      = pkt.gain_db;
                    xp->gain_linear  = db_to_linear(pkt.gain_db);
                    WireCrosspoint wxp = {
                        .enabled      = pkt.enabled,
                        .phase_invert = pkt.phase_invert,
                        .gain_db      = pkt.gain_db,
                    };
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, crosspoints)
                                   + (pkt.input * WIRE_MAX_OUTPUT_CHANNELS + pkt.output)
                                       * sizeof(WireCrosspoint)),
                        sizeof(WireCrosspoint), &wxp);
                }
                break;
            }

            case REQ_SET_OUTPUT_ENABLE: {
                uint8_t out = vendor_last_wValue & 0xFF;
                if (out < NUM_OUTPUT_CHANNELS && vendor_last_wLength >= 1) {
                    uint8_t v = (vendor_rx_buf[0] != 0) ? 1 : 0;
                    matrix_mixer.outputs[out].enabled = v;
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, outputs)
                                   + out * sizeof(WireOutputChannel)
                                   + offsetof(WireOutputChannel, enabled)),
                        1, &v);
                }
                break;
            }

            case REQ_SET_OUTPUT_GAIN: {
                uint8_t out = vendor_last_wValue & 0xFF;
                if (out < NUM_OUTPUT_CHANNELS && vendor_last_wLength >= 4) {
                    float db;
                    memcpy(&db, vendor_rx_buf, 4);
                    matrix_mixer.outputs[out].gain_db     = db;
                    matrix_mixer.outputs[out].gain_linear = db_to_linear(db);
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, outputs)
                                   + out * sizeof(WireOutputChannel)
                                   + offsetof(WireOutputChannel, gain_db)),
                        sizeof(float), &db);
                }
                break;
            }

            case REQ_SET_OUTPUT_MUTE: {
                uint8_t out = vendor_last_wValue & 0xFF;
                if (out < NUM_OUTPUT_CHANNELS && vendor_last_wLength >= 1) {
                    uint8_t v = vendor_rx_buf[0] ? 1 : 0;
                    matrix_mixer.outputs[out].mute = v;
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, outputs)
                                   + out * sizeof(WireOutputChannel)
                                   + offsetof(WireOutputChannel, mute)),
                        1, &v);
                }
                break;
            }

