WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
            case REQ_SET_OUTPUT_DELAY: {
                uint8_t out = vendor_last_wValue & 0xFF;
                if (out < NUM_OUTPUT_CHANNELS && vendor_last_wLength >= 4) {
                    float ms;
                    memcpy(&ms, vendor_rx_buf, 4);
                    if (ms < 0) ms = 0;
                    /* Two storages, must stay in sync (matches bulk_params_apply):
                     *   - matrix_mixer.outputs[out].delay_ms — surfaced via
                     *     REQ_GET_OUTPUT_DELAY and the bulk wire format
                     *   - channel_delays_ms[CH_OUT_1 + out] — what
                     *     dsp_update_delay_samples actually reads to compute
                     *     the per-output sample counts the audio path uses
                     * The earlier impl wrote only the first field, so Console's
                     * output-delay slider was a silent no-op even though the
                     * GET round-tripped fine. */
                    matrix_mixer.outputs[out].delay_ms = ms;
                    channel_delays_ms[CH_OUT_1 + out]  = ms;
                    dsp_update_delay_samples((float)audio_state.freq);
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, outputs)
                                   + out * sizeof(WireOutputChannel)
                                   + offsetof(WireOutputChannel, delay_ms)),
                        sizeof(float), &ms);
                }
                break;
            }

            case REQ_SET_PREAMP: {
                /* Legacy: single-value SET applies to all input channels. */
                if (vendor_last_wLength < 4) break;
                float db; memcpy(&db, vendor_rx_buf, 4);
                for (uint8_t ch = 0; ch < NUM_INPUT_CHANNELS; ++ch) {
                    update_preamp_ch(ch, db);
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, preamp.preamp_db)
                                   + ch * sizeof(float)),
                        sizeof(float), &db);
                }
                break;
            }
            case REQ_SET_PREAMP_CH: {
                if (vendor_last_wLength < 4) break;
                uint8_t ch = vendor_last_wValue & 0xFF;
                if (ch >= NUM_INPUT_CHANNELS) break;
                float db; memcpy(&db, vendor_rx_buf, 4);
                update_preamp_ch(ch, db);
                notify_param_write(
                    (uint16_t)(offsetof(WireBulkParams, preamp.preamp_db)
                               + ch * sizeof(float)),
                    sizeof(float), &db);
                break;
            }

            case REQ_SET_MASTER_VOLUME: {
                if (vendor_last_wLength < 4) break;
                float db; memcpy(&db, vendor_rx_buf, 4);
                update_master_volume(db);
                notify_param_write(offsetof(WireBulkParams, master_volume.master_volume_db),
                                   sizeof(float), &db);
                break;
            }

            case REQ_SET_BYPASS:
                if (vendor_last_wLength >= 1) {
                    bypass_master_eq = (vendor_rx_buf[0] != 0);
                    uint8_t v = bypass_master_eq ? 1 : 0;
                    notify_param_write(offsetof(WireBulkParams, global.bypass), 1, &v);
                }
                break;

            case REQ_SET_DELAY: {
                uint8_t ch = vendor_last_wValue & 0xFF;
                if (ch < NUM_CHANNELS && vendor_last_wLength >= 4) {
                    float ms; memcpy(&ms, vendor_rx_buf, 4);
                    if (ms < 0) ms = 0;
                    channel_delays_ms[ch] = ms;
                    /* Recompute delay-sample counts + any_delay_active bypass
                     * flag for fill_half's Stage 6.5 delay-line stage. */
                    dsp_update_delay_samples((float)audio_state.freq);
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, delays.delay_ms)
                                   + ch * sizeof(float)),
                        sizeof(float), &ms);
                }
                break;
            }

            case REQ_SET_CHANNEL_GAIN: {
                uint8_t ch = vendor_last_wValue & 0xFF;
                if (ch < 3 && vendor_last_wLength >= 4) {
                    float db; memcpy(&db, vendor_rx_buf, 4);
                    float lin = db_to_linear(db);
                    channel_gain_db    [ch] = db;
                    channel_gain_linear[ch] = lin;
                    channel_gain_mul   [ch] = (int32_t)(lin * 32768.0f);
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, legacy.gain_db)
                                   + ch * sizeof(float)),
                        sizeof(float), &db);
                }
                break;
            }
            case REQ_SET_CHANNEL_MUTE: {
                uint8_t ch = vendor_last_wValue & 0xFF;
                if (ch < 3 && vendor_last_wLength >= 1) {
                    uint8_t v = (vendor_rx_buf[0] != 0) ? 1 : 0;
                    channel_mute[ch] = v;
                    notify_param_write(
                        (uint16_t)(offsetof(WireBulkParams, legacy.mute) + ch),
                        1, &v);
                }
                break;
            }

            case REQ_SET_LOUDNESS:
                if (vendor_last_wLength >= 1) {
                    loudness_enabled = (vendor_rx_buf[0] != 0);
                    uint8_t v = loudness_enabled ? 1 : 0;
                    notify_param_write(offsetof(WireBulkParams, global.loudness_enabled),
                                       1, &v);
                }
                break;
            case REQ_SET_LOUDNESS_REF:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v <  40.0f) v =  40.0f;
                    if (v > 100.0f) v = 100.0f;
                    loudness_ref_spl = v;
                    loudness_recompute_pending = true;
                    notify_param_write(offsetof(WireBulkParams, global.loudness_ref_spl),
                                       sizeof(float), &v);
                }
                break;
            case REQ_SET_LOUDNESS_INTENSITY:
                if (vendor_last_wLength >= 4) {
                    float v; memcpy(&v, vendor_rx_buf, 4);
                    if (v <   0.0f) v =   0.0f;
                    if (v > 200.0f) v = 200.0f;
                    loudness_intensity_pct = v;
                    loudness_recompute_pending = true;
                    notify_param_write(offsetof(WireBulkParams, global.loudness_intensity_pct),
                                       sizeof(float), &v);
                }
                break;

