WeebLabs/DSPi-STM32/firmware/STM32/Core/Src/vendor_commands.c
            /* ---- Preset SETs (M11) — backed by W25Q64 + flash_storage.c.
             * The slot index is wValue (0..9). preset_save / load take
             * zero-byte payloads; the rest carry their data in vendor_rx_buf. */
            case REQ_PRESET_SAVE: {
                uint8_t slot = vendor_last_wValue & 0xFF;
                extern volatile uint8_t last_preset_result;
                last_preset_result = preset_save(slot);
                break;
            }
            case REQ_PRESET_LOAD: {
                uint8_t slot = vendor_last_wValue & 0xFF;
                preset_load(slot);
                /* preset_load runs filter recompute + delay update inside
                 * itself; matches the bulk-SET drain in the main loop. */
                break;
            }
            case REQ_PRESET_DELETE: {
                uint8_t slot = vendor_last_wValue & 0xFF;
                preset_delete(slot);
                break;
            }
            case REQ_PRESET_SET_NAME: {
                uint8_t slot = vendor_last_wValue & 0xFF;
                if (vendor_last_wLength > 0 && vendor_last_wLength < 64) {
                    char name[PRESET_NAME_LEN];
                    size_t n = vendor_last_wLength < (PRESET_NAME_LEN - 1)
                             ? vendor_last_wLength : (PRESET_NAME_LEN - 1);
                    memset(name, 0, sizeof(name));
                    memcpy(name, vendor_rx_buf, n);
                    preset_set_name(slot, name);
                }
                break;
            }
            case REQ_PRESET_SET_STARTUP: {
                /* wValue HI = mode (0=specified, 1=last_active),
                 * wValue LO = default slot index (used only when mode=0). */
                uint8_t mode = (vendor_last_wValue >> 8) & 0xFF;
                uint8_t dflt =  vendor_last_wValue       & 0xFF;
                preset_set_startup(mode, dflt);
                break;
            }
            case REQ_PRESET_SET_INCLUDE_PINS: {
                if (vendor_last_wLength >= 1) {
                    preset_set_include_pins(vendor_rx_buf[0] != 0);
                }
                break;
            }

            default:
                /* Other SETs land here once their handlers arrive. */
                break;
        }
        return true;
    }

    /* ---- ACK stage ---- */
    if (stage == CONTROL_STAGE_ACK) {
        if ((req->bmRequestType & 0x80) == 0
            && req->bRequest == REQ_SET_ALL_PARAMS) {
            bulk_params_pending = true;
        }
        return true;
    }

    return true;
}
